Revit 2026 API
UIControlledApplication.CreateRibbonPanel Method
Overload List
Name | Description
CreateRibbonPanel(String)
CreateRibbonPanel(String, String)
CreateRibbonPanel(Tab, String)
Top
See Also
Reference
UIControlledApplication Class
Autodesk.Revit.UI Namespace